Tasks/ЗадачаПоОбработкеДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>ЗадачаПоОбработкеДокумента</Name>
			<Addressing>InformationRegister.ИсполнителиЗадач</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание постановки задачи для исполнителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятаКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительНазначенПринудительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Comment>Описание результата выполнения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прервана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоставПодписи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодписанныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыполненаИзЗаОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Comment>Описание ошибки в результате выполнения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Comment>Плановый срок выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполненияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентныйИнтервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеИнтервалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредметаСтрокой</Name>
					<Comment>Используется для сортировки по типу в формах списков задач</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокНапоминанияОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтсчетаПредельногоСрокаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предшественники</Name>
					<Comment>При отмене выполнения задачи-предшественника требуется прервать все задачи-последователи</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПредшественник</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ЗадачаПоОбработкеДокумента/Forms/ЗадачиСПереданнымиПравами/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьОтбор(Новый Структура("ПоказыватьВыполненные", ПоказыватьВыполненные));
	
	// Установка отбора динамического списка.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ПометкаУдаления", Ложь, ВидСравненияКомпоновкиДанных.Равно, , ,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекущаяДата", ТекущаяДатаСеанса());
	
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "ТипДокумента", , Истина);
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "Предмет", , , Истина, Истина);
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "Ссылка.Предмет", Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина);
	
	ПроцессыОбработкиДокументов.ДобавитьДополнительныеКолонкиСпискаЗадач(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	СгруппироватьПоКолонкеНаСервере(Настройки["РежимГруппировки"]);
	УстановитьОтбор(Настройки);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗадачаПоОбработкеДокумента" Тогда
		ОбновитьСписокЗадачНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьВыполненныеПриИзменении(Элемент)
	УстановитьОтбор(Новый Структура("ПоказыватьВыполненные", ПоказыватьВыполненные));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	УправлениеВидимостьюКоманд(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "Предмет") Тогда
		ПоказатьЗначение(,ТекущиеДанные.Предмет);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгруппироватьПоБезГруппировки(Команда)
	СгруппироватьПоКолонке("");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоАвтору(Команда)
	СгруппироватьПоКолонке("Автор");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоПредмету(Команда)
	СгруппироватьПоКолонке("ТипДокумента");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоЭтапу(Команда)
	СгруппироватьПоКолонке("Этап");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоИсполнителю(Команда)
	СгруппироватьПоКолонке("Исполнитель");
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКИсполнению(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ПринятьЗадачиКИсполнению(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПринятиеКИсполнению(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ОтменитьПринятиеЗадачКИсполнению(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ОтменитьВыполнениеЗадач(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаРольИсполнителя(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ВернутьНаРольИсполнителя(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнформацияОбОшибке(Команда)
	ПроцессыОбработкиДокументовКлиент.ПоказатьИнформациюОбОшибках(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗадач(Команда)
	
	ОбновитьСписокЗадачНаСервере(); 
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ПроцессыОбработкиДокументов.УстановитьОформлениеЗадач(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоКолонке(Знач ИмяКолонкиРеквизита)
	
	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("СтруктураНастроекКомпоновкиДанных") И ЭлементНастроек.Структура.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Пользовательская настройки группировки будет удалена. Продолжить?'");
			Обработчик = Новый ОписаниеОповещения("ПродолжитьГруппировкуПоКолонкеПослеВопроса", ЭтотОбъект, ИмяКолонкиРеквизита);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьГруппировкуПоКолонкеПослеВопроса(Результат, ИмяКолонкиРеквизита) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("СтруктураНастроекКомпоновкиДанных") Тогда
			ЭлементНастроек.Структура.Очистить();
		КонецЕсли;
	КонецЦикла;
	
	ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита)
	
	РежимГруппировки = ИмяКолонкиРеквизита;
	Список.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СгруппироватьПоКолонкеНаСервере(Знач ИмяКолонкиРеквизита)
	РежимГруппировки = ИмяКолонкиРеквизита;
	Список.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗадачНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекущаяДата", ТекущаяДатаСеанса());
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(ПараметрыОтбора)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Выполнена");
	Если НЕ ПараметрыОтбора["ПоказыватьВыполненные"] Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Выполнена", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКоманд(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("Прервана")
		И ТекущиеДанные.Прервана Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("Выполнена")
		И ТекущиеДанные.Выполнена Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Истина;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("ИсполнительНазначенПринудительно")
		И ТекущиеДанные.ИсполнительНазначенПринудительно Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("ПринятаКИсполнению")
		И ТекущиеДанные.ПринятаКИсполнению Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Истина;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("ПринятаКИсполнению")
		И НЕ ТекущиеДанные.ПринятаКИсполнению Тогда
		ДоступностьПринятьКИсполнению = Истина;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		Если ТекущиеДанные.Свойство("Исполнитель")
			И ЗначениеЗаполнено(ТекущиеДанные.Исполнитель)
			И ТекущиеДанные.Свойство("РольИсполнителя")
			И ЗначениеЗаполнено(ТекущиеДанные.РольИсполнителя) Тогда
			ДоступностьВернутьНаРольИсполнителя = Истина;
		Иначе
			ДоступностьВернутьНаРольИсполнителя = Ложь;
		КонецЕсли;
	Иначе
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.Свойство("НеВыполненаИзЗаОшибки")
		И ТекущиеДанные.НеВыполненаИзЗаОшибки Тогда
		ДоступностьИнформацияОбОшибке = Истина;
	Иначе
		ДоступностьИнформацияОбОшибке = Ложь;
	КонецЕсли;
	
	Элементы.ПринятьКИсполнению.Доступность = ДоступностьПринятьКИсполнению;
	Элементы.СписокКонтекстноеМенюПринятьКИсполнению.Доступность = ДоступностьПринятьКИсполнению;
	Элементы.ОтменитьПринятиеКИсполнению.Доступность = ДоступностьОтменитьПринятиеКИсполнению;
	Элементы.СписокКонтекстноеМенюОтменитьПринятиеКИсполнению.Доступность = ДоступностьОтменитьПринятиеКИсполнению;
	Элементы.ОтменитьВыполнение.Доступность = ДоступностьОтменитьВыполнение;
	Элементы.СписокКонтекстноеМенюОтменитьВыполнение.Доступность = ДоступностьОтменитьВыполнение;
	Элементы.ВернутьНаРольИсполнителя.Доступность = ДоступностьВернутьНаРольИсполнителя;
	Элементы.СписокКонтекстноеМенюВернутьНаРольИсполнителя.Доступность = ДоступностьВернутьНаРольИсполнителя;
	Элементы.СписокКонтекстноеМенюИнформацияОбОшибке.Доступность = ДоступностьИнформацияОбОшибке;
	
КонецПроцедуры

#КонецОбласти
